## Importación de librerias

In [1]:
# Importamos sqlite3, la librería estándar de Python para trabajar con bases de datos SQLite
# SQLite es una base de datos embebida que no requiere servidor
import sqlite3

# Importamos datetime para trabajar con fechas y horas
from datetime import datetime

# Importamos pandas para visualizar mejor los resultados
import pandas as pd

# Mensaje de confirmación para saber que todo se importó correctamente
print("Librerías importadas correctamente")

Librerías importadas correctamente

In [2]:
# Creamos la conexión a la base de datos
# sqlite3.connect() crea un archivo .db si no existe o se conecta a uno existente
# Si el archivo 'Proyecto_SQL.db' no existe, se creará automáticamente
conexion = sqlite3.connect('Proyecto_SQL.db')

# Creamos un cursor, que es el objeto que usaremos para ejecutar comandos SQL
# El cursor es como un "puntero" que nos permite navegar y modificar la base de datos
cursor = conexion.cursor()

# Mensajes informativos para confirmar que la conexión fue exitosa
print("Conexión establecida exitosamente")
print(f"Base de datos: Proyecto_SQL.db")

Conexión establecida exitosamente
Base de datos: Proyecto_SQL.db

## Importacion de datos de partida

In [3]:
df_1 = pd.read_csv("./data/clase_1.csv", sep= ";")
df_2 = pd.read_csv("./data/clase_2.csv", sep= ";")
df_3 = pd.read_csv("./data/clase_3.csv", sep= ";")
df_4 = pd.read_csv("./data/clase_4.csv", sep= ";")
df_5 = pd.read_csv("./data/claustro.csv", sep= ";")

In [4]:
df_1.head()

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_HLF,Proyecto_EDA,Proyecto_BBDD,Proyecto_ML,Proyecto_Deployment
0,Jafet Casals,Jafet_Casals@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,Apto,Apto,Apto
1,Jorge Manzanares,Jorge_Manzanares@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,Apto,Apto,Apto
2,Onofre Adadia,Onofre_Adadia@gmail.com,Septiembre,18/09/2023,Madrid,Apto,Apto,Apto,No Apto,Apto
3,Merche Prada,Merche_Prada@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,No Apto,Apto,No Apto
4,Pilar Abella,Pilar_Abella@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,Apto,Apto,Apto

In [5]:
df_2.head()

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_HLF,Proyecto_EDA,Proyecto_BBDD,Proyecto_ML,Proyecto_Deployment
0,Guillermo Borrego,Guillermo_Borrego@gmail.com,Febrero,12/02/2024,Madrid,Apto,No Apto,No Apto,Apto,No Apto
1,Sergio Aguirre,Sergio_Aguirre@gmail.com,Febrero,12/02/2024,Madrid,Apto,No Apto,Apto,Apto,No Apto
2,Carlito Carrión,Carlito_Carrión@gmail.com,Febrero,12/02/2024,Madrid,Apto,No Apto,Apto,Apto,Apto
3,Haydée Figueroa,Haydée_Figueroa@gmail.com,Febrero,12/02/2024,Madrid,Apto,Apto,Apto,Apto,Apto
4,Chita Mancebo,Chita_Mancebo@gmail.com,Febrero,12/02/2024,Madrid,No Apto,Apto,No Apto,Apto,Apto

In [6]:
df_3.rename(columns= {"Proyecto_FullSatck": "Proyecto_FullStack"}, inplace= True)
df_3.head()

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_WebDev,Proyecto_FrontEnd,Proyecto_Backend,Proyecto_React,Proyecto_FullStack
0,Amor Larrañaga,Amor_Larrañaga@gmail.com,Septiembre,18/09/2023,Madrid,Apto,Apto,Apto,Apto,No Apto
1,Teodoro Alberola,Teodoro_Alberola@gmail.com,Septiembre,18/09/2023,Madrid,No Apto,No Apto,Apto,No Apto,Apto
2,Cleto Plana,Cleto_Plana@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,Apto,No Apto,Apto
3,Aitana Sebastián,Aitana_Sebastián@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,Apto,No Apto,Apto
4,Dolores Valbuena,Dolores_Valbuena@gmail.com,Septiembre,18/09/2023,Madrid,Apto,Apto,Apto,Apto,No Apto

In [7]:
df_4.rename(columns= {"Proyecto_FullSatck": "Proyecto_FullStack"}, inplace= True)
df_4.head()

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_WebDev,Proyecto_FrontEnd,Proyecto_Backend,Proyecto_React,Proyecto_FullStack
0,Teresa Laguna,Teresa_Laguna@gmail.com,Febrero,12/02/2024,Valencia,Apto,Apto,Apto,Apto,Apto
1,Estrella Murillo,Estrella_Murillo@gmail.com,Febrero,12/02/2024,Valencia,Apto,Apto,No Apto,Apto,Apto
2,Ernesto Uriarte,Ernesto_Uriarte@gmail.com,Febrero,12/02/2024,Valencia,Apto,Apto,Apto,Apto,Apto
3,Daniela Guitart,Daniela_Guitart@gmail.com,Febrero,12/02/2024,Valencia,Apto,No Apto,No Apto,Apto,Apto
4,Timoteo Trillo,Timoteo_Trillo@gmail.com,Febrero,12/02/2024,Valencia,No Apto,Apto,Apto,Apto,No Apto

In [8]:
df_5.head()

              Nombre Rol Vertical   Promocion    Campus   Modalidad
0          Noa Yáñez  TA       DS  Septiembre    Madrid  Presencial
1  Saturnina Benitez  TA       DS  Septiembre    Madrid  Presencial
2         Anna Feliu  TA       FS  Septiembre    Madrid  Presencial
3      Rosalva Ayuso  TA       FS  Septiembre  Valencia  Presencial
4   Ana Sofía Ferrer  TA       FS     Febrero  Valencia  Presencial

In [9]:
# Merge de los 4 primeros dataframe al tratarse del mismo tipo de información y renombrar df_5
df_alumnos = df_1.merge(df_2, how= 'outer').merge(df_3,how= 'outer').merge(df_4, how= 'outer')
df_profesores = df_5
df_alumnos.head()

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_HLF,Proyecto_EDA,Proyecto_BBDD,Proyecto_ML,Proyecto_Deployment,Proyecto_WebDev,Proyecto_FrontEnd,Proyecto_Backend,Proyecto_React,Proyecto_FullStack
0,Abraham Vélez,Abraham_Vélez@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,No Apto,Apto,Apto,NaN,NaN,NaN,NaN,NaN
1,Aitana Sebastián,Aitana_Sebastián@gmail.com,Septiembre,18/09/2023,Madrid,NaN,NaN,NaN,NaN,NaN,Apto,No Apto,Apto,No Apto,Apto
2,Albino Macias,Albino_Macias@gmail.com,Septiembre,18/09/2023,Madrid,NaN,NaN,NaN,NaN,NaN,No Apto,Apto,Apto,Apto,Apto
3,Alejandra Vilaplana,Alejandra_Vilaplana@gmail.com,Febrero,12/02/2024,Valencia,NaN,NaN,NaN,NaN,NaN,No Apto,No Apto,No Apto,Apto,Apto
4,Amor Larrañaga,Amor_Larrañaga@gmail.com,Septiembre,18/09/2023,Madrid,NaN,NaN,NaN,NaN,NaN,Apto,Apto,Apto,Apto,No Apto

## Creación de tablas

#### Campus

In [10]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS Campus')

# Creamos la tabla Campus con SQL usando cursor.execute()
cursor.execute('''
    CREATE TABLE Campus (
        id_campus INTEGER PRIMARY KEY AUTOINCREMENT,
        nombre_campus VCHAR(50) NOT NULL
    )
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla Campus creada exitosamente")

✓ Tabla Campus creada exitosamente

#### Modalidad

In [11]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS Modalidad')

# Creamos la tabla Modalidad con SQL usando cursor.execute()
cursor.execute('''
    CREATE TABLE Modalidad (
        id_modalidad INTEGER PRIMARY KEY AUTOINCREMENT,
        nombre_modalidad VCHAR(50) NOT NULL
    )
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla Modalidad creada exitosamente")

✓ Tabla Modalidad creada exitosamente

#### Promocion

In [12]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS Promocion')

# Creamos la tabla Promocion con SQL usando cursor.execute()
cursor.execute('''
    CREATE TABLE Promocion (
        id_promocion INTEGER PRIMARY KEY AUTOINCREMENT,
        nombre_promocion VCHAR(50) NOT NULL,
        fecha_promocion DATE NOT NULL
    )
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla Promocion creada exitosamente")

✓ Tabla Promocion creada exitosamente

#### Profesor

In [13]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS Profesor')

# Creamos la tabla Profesor con SQL usando cursor.execute()
cursor.execute('''
    CREATE TABLE Profesor (
        id_profesor INTEGER PRIMARY KEY AUTOINCREMENT,
        id_clase INTEGER,
        nombre_profesor VCHAR(50) NOT NULL,
        rol VCHAR(50) NOT NULL,
        FOREIGN KEY (id_clase) REFERENCES Clases(id_clase) ON DELETE CASCADE
    )
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla Profesor creada exitosamente")

✓ Tabla Profesor creada exitosamente

#### Clase

In [14]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS Clase')

# Creamos la tabla Clase con SQL usando cursor.execute()
cursor.execute('''
    CREATE TABLE Clase (
        id_clase INTEGER PRIMARY KEY AUTOINCREMENT,
        id_campus INTEGER,
        id_modalidad INTEGER,
        id_promocion INTEGER,
        id_vertical INTEGER,
        FOREIGN KEY (id_campus) REFERENCES Campus(id_campus) ON DELETE CASCADE,
        FOREIGN KEY (id_modalidad) REFERENCES Modalidad(id_modalidad) ON DELETE CASCADE,
        FOREIGN KEY (id_promocion) REFERENCES Promocion(id_promocion) ON DELETE CASCADE,
        FOREIGN KEY (id_vertical) REFERENCES Vertical(id_vertical) ON DELETE CASCADE
    )
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla Clase creada exitosamente")

✓ Tabla Clase creada exitosamente

#### Alumnos

In [15]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS Alumnos')

# Creamos la tabla Alumnos con SQL usando cursor.execute()
cursor.execute('''
    CREATE TABLE Alumnos (
        id_alumno INTEGER PRIMARY KEY AUTOINCREMENT,
        nombre_alumno VCHAR(50) NOT NULL,
        email_alumno VCHAR(50) NOT NULL,
        id_clase INTEGER,
        FOREIGN KEY (id_clase) REFERENCES Clase(id_clase) ON DELETE CASCADE
    )
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla Alumnos creada exitosamente")

✓ Tabla Alumnos creada exitosamente

#### Proyectos

In [16]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS Proyectos')

# Creamos la tabla Proyectos con SQL usando cursor.execute()
cursor.execute('''
    CREATE TABLE Proyectos (
        id_proyecto INTEGER PRIMARY KEY AUTOINCREMENT,
        nombre_proyecto VCHAR(50) NOT NULL,
        id_alumno INTEGER,
        id_vertical INTEGER,
        FOREIGN KEY (id_alumno) REFERENCES Alumno(id_alumno) ON DELETE CASCADE,
        FOREIGN KEY (id_vertical) REFERENCES Vertical(id_vertical) ON DELETE CASCADE
    )
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla Proyectos creada exitosamente")

✓ Tabla Proyectos creada exitosamente

#### Notas

In [17]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS Notas')

# Creamos la tabla Notas con SQL usando cursor.execute()
cursor.execute('''
    CREATE TABLE Notas (
        id_nota INTEGER PRIMARY KEY AUTOINCREMENT,
        resultado VCHAR(50) NOT NULL,
        id_proyecto INTEGER,
        id_alumnos INTEGER,
        FOREIGN KEY (id_proyecto) REFERENCES Proyectos(id_proyecto) ON DELETE CASCADE,
        FOREIGN KEY (id_alumnos) REFERENCES Alumnos(id_alumnos) ON DELETE CASCADE
    )
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla Notas creada exitosamente")

✓ Tabla Notas creada exitosamente

#### Vertical

In [18]:
# Primero eliminamos la tabla si ya existe (útil para reiniciar desde cero)
# DROP TABLE IF EXISTS es una operación segura que no da error si la tabla no existe
cursor.execute('DROP TABLE IF EXISTS Vertical')

# Creamos la tabla Vertical con SQL usando cursor.execute()
cursor.execute('''
    CREATE TABLE Vertical (
        id_vertical INTEGER PRIMARY KEY AUTOINCREMENT,
        nombre_vertical VCHAR(50) NOT NULL
    )
''')

# Guardamos los cambios en la base de datos
# commit() hace permanentes los cambios - sin esto, los cambios se pierden
conexion.commit()

print("✓ Tabla Vertical creada exitosamente")

✓ Tabla Vertical creada exitosamente

## Insertar registros

In [19]:
# Funcíon para extraer datos de los datasets
def extraer_datos(indices, dataset):
    """
    Función para extraer los valores de los dataset y convertirlos en lista de tuplas

    Args:
        indices (list): Lista con los nombres de las columnas a extraer
        dataset (str): Nombre del dataset a extraer
    """
    
    return dataset[indices].dropna().drop_duplicates().apply(tuple, axis=1).tolist()

#### Campus

In [20]:
# Creamos una lista de tuplas con los datos a insertar
campus_intro = extraer_datos(["Campus"], df_alumnos)

cursor.executemany('''
    INSERT OR IGNORE INTO Campus (nombre_campus)
    VALUES (?)
''', campus_intro)

# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(campus_intro)} campus insertados correctamente")

✓ 2 campus insertados correctamente

#### Modalidad

In [21]:
extraer_datos(["Modalidad"], df_profesores)

[('Presencial',), ('Online',)]

In [22]:
# Creamos una lista de tuplas con los datos a insertar
modalidad_intro = extraer_datos(["Modalidad"], df_profesores)

cursor.executemany('''
    INSERT OR IGNORE INTO Modalidad (nombre_modalidad)
    VALUES (?)
''', modalidad_intro)

# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(modalidad_intro)} modalidades insertadas correctamente")

✓ 2 modalidades insertadas correctamente

#### Promocion

In [23]:
# Creamos una lista de tuplas con los datos a insertar
promocion_intro = extraer_datos(["Promoción", "Fecha_comienzo"], df_alumnos)

cursor.executemany('''
    INSERT OR IGNORE INTO Promocion (nombre_promocion, fecha_promocion)
    VALUES (?, ?)
''', promocion_intro)

# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(promocion_intro)} promociones insertadas correctamente")

✓ 2 promociones insertadas correctamente

#### Vertical

In [24]:
# Creamos una lista de tuplas con los datos a insertar
vertical_intro = extraer_datos(["Vertical"], df_profesores)

cursor.executemany('''
    INSERT OR IGNORE INTO Vertical (nombre_vertical)
    VALUES (?)
''', vertical_intro)

# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(vertical_intro)} verticales insertadas correctamente")

✓ 2 verticales insertadas correctamente

#### Clase

In [25]:
# Creamos una lista de tuplas con los datos a insertar
clases = df_profesores[['Campus', 'Modalidad', 'Promocion', 'Vertical']].drop_duplicates()

for _, row in clases.iterrows():
    # Obtener IDs
    id_campus = cursor.execute('SELECT id_campus FROM Campus WHERE nombre_campus = ?', 
                                (row['Campus'],)).fetchone()[0]
    id_modalidad = cursor.execute('SELECT id_modalidad FROM Modalidad WHERE nombre_modalidad = ?', 
                                    (row['Modalidad'],)).fetchone()[0]
    id_promocion = cursor.execute('SELECT id_promocion FROM Promocion WHERE nombre_promocion = ?', 
                                    (row['Promocion'],)).fetchone()[0]
    id_vertical = cursor.execute('SELECT id_vertical FROM Vertical WHERE nombre_vertical = ?', 
                                (row['Vertical'],)).fetchone()[0]
    
    cursor.execute('''
        INSERT OR IGNORE INTO Clase (id_campus, id_modalidad, id_promocion, id_vertical)
        VALUES (?, ?, ?, ?)
    ''', (id_campus, id_modalidad, id_promocion, id_vertical))

# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(clases)} clases insertadas correctamente")

✓ 8 clases insertadas correctamente

#### Profesor

In [26]:
# Creamos una lista de tuplas con los datos a insertar
for _, row in df_profesores.iterrows():
    # Obtener id_clase
    id_campus = cursor.execute('SELECT id_campus FROM Campus WHERE nombre_campus = ?', 
                                (row['Campus'],)).fetchone()[0]
    id_modalidad = cursor.execute('SELECT id_modalidad FROM Modalidad WHERE nombre_modalidad = ?', 
                                    (row['Modalidad'],)).fetchone()[0]
    id_promocion = cursor.execute('SELECT id_promocion FROM Promocion WHERE nombre_promocion = ?', 
                                    (row['Promocion'],)).fetchone()[0]
    id_vertical = cursor.execute('SELECT id_vertical FROM Vertical WHERE nombre_vertical = ?', 
                                (row['Vertical'],)).fetchone()[0]
    
    id_clase = cursor.execute('''
        SELECT id_clase FROM Clase 
        WHERE id_campus = ? AND id_modalidad = ? AND id_promocion = ? AND id_vertical = ?
    ''', (id_campus, id_modalidad, id_promocion, id_vertical)).fetchone()[0]
    
    cursor.execute('''
        INSERT INTO Profesor (nombre_profesor, rol, id_clase)
        VALUES (?, ?, ?)
    ''', (row['Nombre'], row['Rol'], id_clase))

# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(df_profesores)} profesores insertados correctamente")

✓ 10 profesores insertados correctamente

#### Proyectos

In [27]:
# Creamos una lista de tuplas con los datos a insertar
proyectos_columnas = ['Proyecto_HLF', 'Proyecto_EDA', 'Proyecto_BBDD', 'Proyecto_ML',
                        'Proyecto_Deployment', 'Proyecto_WebDev', 'Proyecto_FrontEnd', 
                        'Proyecto_Backend', 'Proyecto_React', 'Proyecto_FullStack']

# Mapeo de proyectos a verticales
proyecto_vertical_map = {
    'Proyecto_HLF': 'DS',
    'Proyecto_EDA': 'DS',
    'Proyecto_BBDD': 'DS',
    'Proyecto_ML': 'DS',
    'Proyecto_Deployment': 'DS',
    'Proyecto_WebDev': 'FS',
    'Proyecto_FrontEnd': 'FS',
    'Proyecto_Backend': 'FS',
    'Proyecto_React': 'FS',
    'Proyecto_FullSatck': 'FS'
}

for proyecto in proyectos_columnas:
    vertical_nombre = proyecto_vertical_map.get(proyecto)
    id_vertical = None
    if vertical_nombre:
        result = cursor.execute('SELECT id_vertical FROM Vertical WHERE nombre_vertical = ?', 
                                (vertical_nombre,)).fetchone()
        if result:
            id_vertical = result[0]
    
    cursor.execute('''
        INSERT OR IGNORE INTO Proyectos (nombre_proyecto, id_vertical)
        VALUES (?, ?)
    ''', (proyecto, id_vertical))
    
# Guardamos todos los cambios a la vez
conexion.commit()

print(f"✓ {len(proyectos_columnas)} proyectos insertados correctamente")

✓ 10 proyectos insertados correctamente

#### Alumnos y Notas

In [28]:
# Creamos una lista de tuplas con los datos a insertar
for _, alumno in df_alumnos.iterrows():
    # Obtener id_clase del alumno
    id_campus = cursor.execute('SELECT id_campus FROM Campus WHERE nombre_campus = ?', 
                                (alumno['Campus'],)).fetchone()[0]
    id_promocion = cursor.execute('SELECT id_promocion FROM Promocion WHERE nombre_promocion = ?', 
                                    (alumno['Promoción'],)).fetchone()[0]
    
    # Para alumnos, necesitamos hacer una suposición sobre modalidad y vertical
    # Opción: tomar la primera clase que coincida con campus y promoción
    id_clase_result = cursor.execute('''
        SELECT id_clase FROM Clase 
        WHERE id_campus = ? AND id_promocion = ?
        LIMIT 1
    ''', (id_campus, id_promocion)).fetchone()
    
    if id_clase_result:
        id_clase = id_clase_result[0]
        
        # Insertar alumno
        cursor.execute('''
            INSERT OR IGNORE INTO Alumnos (nombre_alumno, email_alumno, id_clase)
            VALUES (?, ?, ?)
        ''', (alumno['Nombre'], alumno['Email'], id_clase))
        
        # Obtener id_alumno
        id_alumno = cursor.execute('SELECT id_alumno FROM Alumnos WHERE email_alumno = ?', 
                                    (alumno['Email'],)).fetchone()[0]
        
        # Insertar notas de todos los proyectos
        for proyecto_col in proyectos_columnas:
            if pd.notna(alumno[proyecto_col]):
                id_proyecto = cursor.execute('SELECT id_proyecto FROM Proyectos WHERE nombre_proyecto = ?', 
                                            (proyecto_col,)).fetchone()[0]
                
                cursor.execute('''
                    INSERT OR IGNORE INTO Notas (id_alumnos, id_proyecto, resultado)
                    VALUES (?, ?, ?)
                ''', (id_alumno, id_proyecto, alumno[proyecto_col]))

conexion.commit()
print(f"✓ Insertados {len(df_alumnos)} alumnos con sus notas")

✓ Insertados 52 alumnos con sus notas

### Pruebas de Query

In [29]:
# Función para realizar queries
def sql_query(query):
    return pd.read_sql(query, conexion)

In [34]:
query = '''
select *
from Notas
'''

sql_query(query)

     id_nota resultado  id_proyecto  id_alumnos
0          1      Apto            1           1
1          2   No Apto            2           1
2          3   No Apto            3           1
3          4      Apto            4           1
4          5      Apto            5           1
..       ...       ...          ...         ...
255      256   No Apto            6          52
256      257      Apto            7          52
257      258      Apto            8          52
258      259      Apto            9          52
259      260   No Apto           10          52

[260 rows x 4 columns]